Revit 2027 API
WallSweepInfo Methods
The WallSweepInfo type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsEqual |  Determines if the input object is equivalent to this WallSweepInfo.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace